OdString.getBuffer(System.Int32)
\details
Returns a modifiable C style OdChar array (buffer) of the specified minimum length for this String object.
\param minBufferLength [in]  Minimum buffer length.
\remarks
releaseBuffer() should be called before using any other OdString methods.
The pointer returned by this function is not valid after releaseBuffer() is called.